Revit 2024 API
IExternalResourceServer.GetInformationLink Method
 The method that Revit will invoke to obtain a URL address which provides more information about the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
string GetInformationLink()
Visual Basic
Function GetInformationLink As String
Visual C++
String^ GetInformationLink()
Return Value
 The URL providing server information.
See Also
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace